<?php
// +----------------------------------------------------------------------
// | 海豚PHP框架 [ DThinkPHP ]
// +----------------------------------------------------------------------
// | 版权所有 2016~2017 河源市卓锐科技有限公司 [ http://www.thinkphp.cn ]
// +----------------------------------------------------------------------
// | 官方网站: http://DThinkPHP.com
// +----------------------------------------------------------------------
// | 开源协议 ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------

/**
 * 模块信息
 */
return [
    // 模块名[必填]
    'name' => 'anymodule',
    // 模块标题[必填]
    'title' => 'anymodule',
    // 模块唯一标识[必填]，格式：模块名.开发者标识.module
    'identifier' => 'anymodule.anymodule.module',
    // 模块图标[选填]
    'icon' => 'fa fa-fw fa-newspaper-o',
    // 模块描述[选填]
    'description' => '模块名称',
    // 开发者[必填]
    'author' => 'YourFather',
    // 版本[必填],格式采用三段式：主版本号.次版本号.修订版本号
    'version' => '1.0.0',
    // 模块依赖[可选]，格式[[模块名, 模块唯一标识, 依赖版本, 对比方式]]
    'need_module' => [
    ],

];
